""" Задание №1
Необходимо написать программу, которая требует у пользователя
ввести два целых числа, строку и одно дробное число, далее выводит
на экран строку и сумму двух целых и дробного числа"""
a = int(input())
b = int(input())
s = input()
c = float(input())
print(s, a+b+c)
