'''
Создать 4 переменных. С типом данных целых чисел, чисел с плавающей точкой,
логическим и строковым.
 Преобразовать числа в строку.
'''
a = 5
b = 5.3
c = False
s = 'cat'
a_st = str(a)
b_st = str(b)
print(type(a_st), type(b_st))